Repository: wpbones/WPKirk-Database-Boilerplate
Catalog: languages/wp-kirk-*.po
Languages: it_it

source: WP Bones Boilerplate WordPress plugin
it_it: WP Bones Boilerplate Plugin WordPress

source: Query Builder
it_it: Generatore di query

source: WP Bones's database query builder provides a convenient, fluent interface to creating and running database queries. It can be used to perform most database operations in your WordPress instance.
it_it: Il generatore di query per database di WP Bones fornisce un'interfaccia comoda e fluida per la creazione e l'esecuzione di query su database. Può essere utilizzato per eseguire la maggior parte delle operazioni di database nell'istanza di WordPress.

source: Example
it_it: Esempio

source: You can find more
it_it: Puoi trovare di più

source: example here
it_it: esempio qui

source: Migrations & Seeders
it_it: Migrazioni e Seeder

source: You may use the migrations to create your own custom database tables.
it_it: È possibile utilizzare le migrazioni per creare tabelle di database personalizzate.

source: And the Seeder to insert default records
it_it: E il Seeder per inserire i record predefiniti

source: No Prefix
it_it: Nessun prefisso

source: You can set the `usePrefix` property to false in the model to not use the WordPress prefix.
it_it: È possibile impostare la proprietà 'usePrefix' su false nel modello per non utilizzare il prefisso di WordPress.

source: Or you can use the `tableWithoutPrefix()` method as shorthand.
it_it: Oppure puoi utilizzare il metodo 'tableWithoutPrefix()' come abbreviazione.

source: You may include the Eloquent ORM to provide a beautiful, simple ActiveRecord implementation for working with your database. Each database table has a corresponding "Model" which is used to interact with that table. Models allow you to query for data in your tables, as well as insert new records into the table.
it_it: È possibile includere l'Eloquent ORM per fornire un'implementazione ActiveRecord semplice e bella per lavorare con il database. Ogni tabella di database ha un "Modello" corrispondente che viene utilizzato per interagire con quella tabella. I modelli consentono di eseguire query sui dati nelle tabelle e di inserire nuovi record nella tabella.

source: You may install Eloquent ORM in your plugin by using
it_it: Puoi installare Eloquent ORM nel tuo plugin utilizzando

source: As we are using the complete illuminate database package, for further documentation on using the various database facilities this library provides, consult the
it_it: Poiché stiamo utilizzando il pacchetto completo del database illuminate, per ulteriore documentazione sull'utilizzo delle varie strutture di database fornite da questa biblioteca, consultare il

source: Laravel framework documentation
it_it: Documentazione del framework Laravel

source: Query WordPress users table
it_it: Interroga la tabella degli utenti di WordPress

source: Find a user by ID
it_it: Trovare un utente in base all'ID

source: Of course, you'll be able to use all eloquent features
it_it: Naturalmente, sarai in grado di utilizzare tutte le caratteristiche eloquenti

source: Custom Database Table
it_it: Tabella del database personalizzata

source: Alongside the WordPress table you may use eloquent for your custom database table
it_it: Oltre alla tabella di WordPress, puoi utilizzare eloquent per la tua tabella di database personalizzata

source: You can use the Eloquent ORM to interact with your custom database tables.
it_it: È possibile utilizzare l'ORM Eloquent per interagire con le tabelle del database personalizzate.

source: and get single column value
it_it: e ottieni il valore di una singola colonna

source: Loop into
it_it: Ciclare nel risultati

source: You can loop into the results
it_it: È possibile eseguire il ciclo nei risultati

source: For further documentation on using the various database facilities this library provides, consult the
it_it: Per ulteriore documentazione sull'utilizzo delle varie strutture di database fornite da questa biblioteca, consultare il

source: Eloquent Model with no WordPress prefix
it_it: Modello eloquente senza prefisso WordPress

source: You can use an Eloquent model without the WordPress prefix. Just define your model as shown below.
it_it: È possibile utilizzare un modello Eloquent senza il prefisso di WordPress. Basta definire il modello come mostrato di seguito.

source: In short, use `false` as the second parameter in `DB::getTableName()`
it_it: In breve, usa 'false' come secondo parametro in 'DB::getTableName()'

source: and loop into the results
it_it: e si ripetono nei risultati

source: You can use the model class to interact with the database.
it_it: È possibile utilizzare la classe del modello per interagire con il database.

source: More Examples
it_it: Altri esempi

source: Class Model
it_it: Modello di classe

source: In your Plugin you may use the Database Model class instead of the
it_it: Nel tuo Plugin potresti utilizzare la classe Modello di Database invece del

source: To use the Model convection you need to extend the Model class:
it_it: Per utilizzare la convenzione Model è necessario estendere la classe Model:

source: We don't support the automatic plural naming of the table at the moment. Anyway, the default table name will be the "snake case" of the class name. For example, the class `Users` will be associated with the table `users`. The class `UsersLogged` will be associated with the table `users_logged`.
it_it: Al momento non supportiamo la denominazione automatica al plurale delle tabelle. Comunque, il nome predefinito della tabella sarà il “snake case” del nome della classe. Ad esempio, la classe `Users` sarà associata alla tabella `users`. La classe `UsersLogged` sarà associata alla tabella `users_logged`.

source: If your model's corresponding database table does not fit this convention, you may manually specify the model's table name by defining a `table` property on the model:
it_it: Se la tabella del database corrispondente al tuo modello non segue questa convenzione, puoi specificare manualmente il nome della tabella del modello definendo una proprietà `table` sul modello:

source: You can also disable the prefix by setting the `usePrefix` property to `false`.
it_it: È inoltre possibile disabilitare il prefisso impostando la proprietà 'usePrefix' su 'false'.

source: You may also define a WP Bones Model and use the class directly.
it_it: Puoi anche definire un modello WP Bones e utilizzare direttamente la classe.
